БухЭксп/Reports/CW_ЛичныйКабинетАктивныеПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_ЛичныйКабинетАктивныеПользователи</Name>
		</Properties>
	</Report>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПользователиВебПрофилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПользователиВебПрофилей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВебПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофилиЗаявок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофилиПеревозок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Comment>"ГРУЗОПЕРЕВОЗКИ", "ЗАЯВКИ"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Reports/CW_ЛичныйКабинетАктивныеПользователи/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мАктивныеПользователи = Справочники.CW_ВебПользователиЛКК.ПолучитьМассивИдентификаторовАктивныхПользователей();
	
	Запрос = новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |	CW_ПользователиВебПрофилей.Раздел КАК Раздел,
	              |	CW_ПользователиВебПрофилей.Пользователь КАК Пользователь,
	              |	ВЫБОР
	              |		КОГДА CW_ПользователиВебПрофилей.Пользователь.ИдентифкаторПользователя В (&мАктивныеПользователи)
	              |			ТОГДА ИСТИНА
	              |		ИНАЧЕ ЛОЖЬ
	              |	КОНЕЦ КАК Активный,
	              |	CW_ПользователиВебПрофилей.Пользователь КАК Количество,
	              |	ВЫБОР
	              |		КОГДА CW_ПользователиВебПрофилей.Пользователь.ИдентифкаторПользователя В (&мАктивныеПользователи)
	              |			ТОГДА CW_ПользователиВебПрофилей.Пользователь
	              |		ИНАЧЕ NULL
	              |	КОНЕЦ КАК КоличествоАктивных
	              |ИЗ
	              |	РегистрСведений.CW_ПользователиВебПрофилей КАК CW_ПользователиВебПрофилей
	              |ГДЕ
	              |	CW_ПользователиВебПрофилей.Пользователь.ИдентифкаторПользователя <> """"";
	
	Запрос.УстановитьПараметр("мАктивныеПользователи", мАктивныеПользователи);
	
	РезультатЗапроса = Запрос.Выполнить();
				  
	НаборыДанных 	= Новый Структура("НаборДанных", РезультатЗапроса.Выгрузить());
	СКД 			= СхемаКомпоновкиДанных;
	
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(СКД, СКД.НастройкиПоУмолчанию);
	ПроцессорКомпДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпДанных.Инициализировать(МакетКомпоновки, НаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпДанных, Истина);

КонецПроцедуры
